---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures
source: html/b67f74b9-4336-74df-edd9-04f5d08be033.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures

Failures about System.

## Syntax (C#)
```csharp
public static class SystemsFailures
```